#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.repository["atc-core"].github_repository_file.files[".make/docker.mk"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/docker.mk
            
            DOCKER_BUILD_PATH ?= .
            
            .help-docker:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Docker targets$(SGR0)"
            	@echo "  $(BOLD)docker-build$(SGR0)   -- Run docker build to create new image"
            	@echo "  $(BOLD)docker-run$(SGR0)     -- Run docker container as a daemon, binding port $(HOST_PORT):$(DOCKER_PORT)"
            	@echo "  $(BOLD)docker-stop$(SGR0)    -- Run 'docker kill $${DOCKER_NAME}-run' to stop our docker after running"
            
            docker-build:
            	@DOCKER_BUILDKIT=1 docker build --build-arg PACKAGE_NAME=$(PACKAGE_NAME) --tag $(PACKAGE_NAME):latest $(DOCKER_BUILD_PATH)
            
            docker-run: docker-stop
            	# Run docker container as a daemon and map a port
          - 	@docker run --rm -d -p $(HOST_PORT_GRPC):$(DOCKER_PORT_GRPC) -p $(HOST_PORT_REST):$(DOCKER_PORT_REST) --name=$(DOCKER_NAME)-run $(PACKAGE_NAME):latest
          + 	@docker run --rm -d --env-file .env -p $(HOST_PORT_GRPC):$(DOCKER_PORT_GRPC) -p $(HOST_PORT_REST):$(DOCKER_PORT_REST) --name=$(DOCKER_NAME)-run $(PACKAGE_NAME):latest
            	@echo "$(YELLOW)Docker running and listening to http://localhost:$(HOST_PORT_GRPC) and http://localhost:$(HOST_PORT_REST) $(SGR0)"
            
            docker-stop:
            	@docker kill ${DOCKER_NAME}-run || true
        EOT
        id                  = "atc-core/.make/docker.mk"
        # (7 unchanged attributes hidden)
    }

  # module.repository["atc-core"].github_repository_file.files[".make/env.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = "chore(ci): .make/env.mk - provisioned by terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/env.mk
            
            ENV_FILE := $(wildcard .env .env.base)
            # If .env is missing, install .env.base+.env.repo as .env and load that.
            ifeq ($(ENV_FILE),.env.base)
            $(warning Settings file '.env' missing: '$(ENV_FILE)' => installing .env as merge of .env.base + .env.repo!)
            $(shell cat .env.base .env.repo > .env 2>/dev/null)
            endif
            
            # Sanity check, make sure keys from base and repo are present.
            # Strip empty lines and comments, get sorted keys (e.g. DOCKER_NAME)
            ENV_KEYS=$(shell grep -Ehv '^\s*(#.*)?\s*$$' .env.base .env.repo 2>/dev/null | cut -f1 -d= | sort)
            # Check if key exists in .env, if not grep it from the .env.base/repo into your .env
            $(foreach k, $(ENV_KEYS), $(eval $(shell sh -c "grep -q '^$(k)=' .env 2>/dev/null || (echo '*** NOTE: Adding missing .env key [$(k)] to your .env file!' 1>&2 ; grep -h '^$(k)=' .env.base .env.repo 2>/dev/null >> .env ; grep '^$(k)=' .env 1>&2)")))
            
            -include $(ENV_FILE)
            
        EOT
      + file                = ".make/env.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "atc-core"
      + sha                 = (known after apply)
    }

  # module.repository["benchmarks"].github_repository_file.files[".make/docker.mk"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/docker.mk
            
            DOCKER_BUILD_PATH ?= .
            
            .help-docker:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Docker targets$(SGR0)"
            	@echo "  $(BOLD)docker-build$(SGR0)   -- Run docker build to create new image"
            	@echo "  $(BOLD)docker-run$(SGR0)     -- Run docker container as a daemon, binding port $(HOST_PORT):$(DOCKER_PORT)"
            	@echo "  $(BOLD)docker-stop$(SGR0)    -- Run 'docker kill $${DOCKER_NAME}-run' to stop our docker after running"
            
            docker-build:
            	@DOCKER_BUILDKIT=1 docker build --build-arg PACKAGE_NAME=$(PACKAGE_NAME) --tag $(PACKAGE_NAME):latest $(DOCKER_BUILD_PATH)
            
            docker-run: docker-stop
            	# Run docker container as a daemon and map a port
          - 	@docker run --rm -d -p $(HOST_PORT_GRPC):$(DOCKER_PORT_GRPC) -p $(HOST_PORT_REST):$(DOCKER_PORT_REST) --name=$(DOCKER_NAME)-run $(PACKAGE_NAME):latest
          + 	@docker run --rm -d --env-file .env -p $(HOST_PORT_GRPC):$(DOCKER_PORT_GRPC) -p $(HOST_PORT_REST):$(DOCKER_PORT_REST) --name=$(DOCKER_NAME)-run $(PACKAGE_NAME):latest
            	@echo "$(YELLOW)Docker running and listening to http://localhost:$(HOST_PORT_GRPC) and http://localhost:$(HOST_PORT_REST) $(SGR0)"
            
            docker-stop:
            	@docker kill ${DOCKER_NAME}-run || true
        EOT
        id                  = "benchmarks/.make/docker.mk"
        # (7 unchanged attributes hidden)
    }

  # module.repository["benchmarks"].github_repository_file.files[".make/env.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = "chore(ci): .make/env.mk - provisioned by terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/env.mk
            
            ENV_FILE := $(wildcard .env .env.base)
            # If .env is missing, install .env.base+.env.repo as .env and load that.
            ifeq ($(ENV_FILE),.env.base)
            $(warning Settings file '.env' missing: '$(ENV_FILE)' => installing .env as merge of .env.base + .env.repo!)
            $(shell cat .env.base .env.repo > .env 2>/dev/null)
            endif
            
            # Sanity check, make sure keys from base and repo are present.
            # Strip empty lines and comments, get sorted keys (e.g. DOCKER_NAME)
            ENV_KEYS=$(shell grep -Ehv '^\s*(#.*)?\s*$$' .env.base .env.repo 2>/dev/null | cut -f1 -d= | sort)
            # Check if key exists in .env, if not grep it from the .env.base/repo into your .env
            $(foreach k, $(ENV_KEYS), $(eval $(shell sh -c "grep -q '^$(k)=' .env 2>/dev/null || (echo '*** NOTE: Adding missing .env key [$(k)] to your .env file!' 1>&2 ; grep -h '^$(k)=' .env.base .env.repo 2>/dev/null >> .env ; grep '^$(k)=' .env 1>&2)")))
            
            -include $(ENV_FILE)
            
        EOT
      + file                = ".make/env.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "benchmarks"
      + sha                 = (known after apply)
    }

  # module.repository["tool-simulation"].github_repository_file.files[".make/docker.mk"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/docker.mk
            
            DOCKER_BUILD_PATH ?= .
            
            .help-docker:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Docker targets$(SGR0)"
            	@echo "  $(BOLD)docker-build$(SGR0)   -- Run docker build to create new image"
            	@echo "  $(BOLD)docker-run$(SGR0)     -- Run docker container as a daemon, binding port $(HOST_PORT):$(DOCKER_PORT)"
            	@echo "  $(BOLD)docker-stop$(SGR0)    -- Run 'docker kill $${DOCKER_NAME}-run' to stop our docker after running"
            
            docker-build:
            	@DOCKER_BUILDKIT=1 docker build --build-arg PACKAGE_NAME=$(PACKAGE_NAME) --tag $(PACKAGE_NAME):latest $(DOCKER_BUILD_PATH)
            
            docker-run: docker-stop
            	# Run docker container as a daemon and map a port
          - 	@docker run --rm -d -p $(HOST_PORT_GRPC):$(DOCKER_PORT_GRPC) -p $(HOST_PORT_REST):$(DOCKER_PORT_REST) --name=$(DOCKER_NAME)-run $(PACKAGE_NAME):latest
          + 	@docker run --rm -d --env-file .env -p $(HOST_PORT_GRPC):$(DOCKER_PORT_GRPC) -p $(HOST_PORT_REST):$(DOCKER_PORT_REST) --name=$(DOCKER_NAME)-run $(PACKAGE_NAME):latest
            	@echo "$(YELLOW)Docker running and listening to http://localhost:$(HOST_PORT_GRPC) and http://localhost:$(HOST_PORT_REST) $(SGR0)"
            
            docker-stop:
            	@docker kill ${DOCKER_NAME}-run || true
        EOT
        id                  = "tool-simulation/.make/docker.mk"
        # (7 unchanged attributes hidden)
    }

  # module.repository["tool-simulation"].github_repository_file.files[".make/env.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = "chore(ci): .make/env.mk - provisioned by terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/env.mk
            
            ENV_FILE := $(wildcard .env .env.base)
            # If .env is missing, install .env.base+.env.repo as .env and load that.
            ifeq ($(ENV_FILE),.env.base)
            $(warning Settings file '.env' missing: '$(ENV_FILE)' => installing .env as merge of .env.base + .env.repo!)
            $(shell cat .env.base .env.repo > .env 2>/dev/null)
            endif
            
            # Sanity check, make sure keys from base and repo are present.
            # Strip empty lines and comments, get sorted keys (e.g. DOCKER_NAME)
            ENV_KEYS=$(shell grep -Ehv '^\s*(#.*)?\s*$$' .env.base .env.repo 2>/dev/null | cut -f1 -d= | sort)
            # Check if key exists in .env, if not grep it from the .env.base/repo into your .env
            $(foreach k, $(ENV_KEYS), $(eval $(shell sh -c "grep -q '^$(k)=' .env 2>/dev/null || (echo '*** NOTE: Adding missing .env key [$(k)] to your .env file!' 1>&2 ; grep -h '^$(k)=' .env.base .env.repo 2>/dev/null >> .env ; grep '^$(k)=' .env 1>&2)")))
            
            -include $(ENV_FILE)
            
        EOT
      + file                = ".make/env.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tool-simulation"
      + sha                 = (known after apply)
    }

  # module.repository["tool-simulation"].github_repository_file.files["Makefile"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
          - # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/Makefile.tftpl
          + # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/Makefile
            
          - DOCKER_NAME          := arrow-tool-simulation
          - PACKAGE_NAME         := tool-simulation
          + DOCKER_NAME := arrow-tool-simulation
            
          - PUBLISH_PACKAGE_NAME := tool-simulation-client-grpc
          - DOCKER_PORT_REST     := 8000
          - DOCKER_PORT_GRPC     := 50051
          - HOST_PORT_REST       := 3000
          - HOST_PORT_GRPC       := 
          + help: .help-base .help-cspell .help-markdown .help-editorconfig
            
          - help: .help-base .help-rust .help-python .help-cspell .help-markdown .help-editorconfig .help-commitlint .help-toml .help-docker
          - build: rust-build docker-build
          - 
          - include .make/docker.mk
          - 
          - export
          - 
          - clean: rust-clean
          - release: rust-release
          - publish: rust-publish
          - test: rust-test-all cspell-test toml-test python-test md-test-links editorconfig-test
          - tidy: rust-tidy toml-tidy python-tidy editorconfig-tidy
          - all: clean test build release publish
          - 
            include .make/base.mk
            include .make/cspell.mk
            include .make/markdown.mk
            include .make/editorconfig.mk
          - include .make/commitlint.mk
          - include .make/toml.mk
          - include .make/rust.mk
          - include .make/python.mk
          + 
          + test: cspell-test md-test-links editorconfig-test
        EOT
        id                  = "tool-simulation/Makefile"
        # (7 unchanged attributes hidden)
    }

  # module.repository_lib_template["rust"].github_repository_file.files[".env.base.tftpl"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = "chore(ci): .env.base.tftpl - provisioned by terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-lib/.env.base.tftpl
            
            DOCKER_NAME          := arrow-lib-template-rust
            PACKAGE_NAME         := lib-template-rust
            PUBLISH_PACKAGE_NAME := lib-template-rust
            
        EOT
      + file                = ".env.base.tftpl"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-template-rust"
      + sha                 = (known after apply)
    }

  # module.repository_lib_template["rust"].github_repository_file.files[".make/docker.mk"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/docker.mk
            
            DOCKER_BUILD_PATH ?= .
            
            .help-docker:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Docker targets$(SGR0)"
            	@echo "  $(BOLD)docker-build$(SGR0)   -- Run docker build to create new image"
            	@echo "  $(BOLD)docker-run$(SGR0)     -- Run docker container as a daemon, binding port $(HOST_PORT):$(DOCKER_PORT)"
            	@echo "  $(BOLD)docker-stop$(SGR0)    -- Run 'docker kill $${DOCKER_NAME}-run' to stop our docker after running"
            
            docker-build:
            	@DOCKER_BUILDKIT=1 docker build --build-arg PACKAGE_NAME=$(PACKAGE_NAME) --tag $(PACKAGE_NAME):latest $(DOCKER_BUILD_PATH)
            
            docker-run: docker-stop
            	# Run docker container as a daemon and map a port
          - 	@docker run --rm -d -p $(HOST_PORT_GRPC):$(DOCKER_PORT_GRPC) -p $(HOST_PORT_REST):$(DOCKER_PORT_REST) --name=$(DOCKER_NAME)-run $(PACKAGE_NAME):latest
          + 	@docker run --rm -d --env-file .env -p $(HOST_PORT_GRPC):$(DOCKER_PORT_GRPC) -p $(HOST_PORT_REST):$(DOCKER_PORT_REST) --name=$(DOCKER_NAME)-run $(PACKAGE_NAME):latest
            	@echo "$(YELLOW)Docker running and listening to http://localhost:$(HOST_PORT_GRPC) and http://localhost:$(HOST_PORT_REST) $(SGR0)"
            
            docker-stop:
            	@docker kill ${DOCKER_NAME}-run || true
        EOT
        id                  = "lib-template-rust/.make/docker.mk"
        # (7 unchanged attributes hidden)
    }

  # module.repository_lib_template["rust"].github_repository_file.files[".make/env.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = "chore(ci): .make/env.mk - provisioned by terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/env.mk
            
            ENV_FILE := $(wildcard .env .env.base)
            # If .env is missing, install .env.base+.env.repo as .env and load that.
            ifeq ($(ENV_FILE),.env.base)
            $(warning Settings file '.env' missing: '$(ENV_FILE)' => installing .env as merge of .env.base + .env.repo!)
            $(shell cat .env.base .env.repo > .env 2>/dev/null)
            endif
            
            # Sanity check, make sure keys from base and repo are present.
            # Strip empty lines and comments, get sorted keys (e.g. DOCKER_NAME)
            ENV_KEYS=$(shell grep -Ehv '^\s*(#.*)?\s*$$' .env.base .env.repo 2>/dev/null | cut -f1 -d= | sort)
            # Check if key exists in .env, if not grep it from the .env.base/repo into your .env
            $(foreach k, $(ENV_KEYS), $(eval $(shell sh -c "grep -q '^$(k)=' .env 2>/dev/null || (echo '*** NOTE: Adding missing .env key [$(k)] to your .env file!' 1>&2 ; grep -h '^$(k)=' .env.base .env.repo 2>/dev/null >> .env ; grep '^$(k)=' .env 1>&2)")))
            
            -include $(ENV_FILE)
            
        EOT
      + file                = ".make/env.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-template-rust"
      + sha                 = (known after apply)
    }

  # module.repository_lib_template["rust"].github_repository_file.files["Makefile"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
          - # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/Makefile.tftpl
          + # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/Makefile
            
          - DOCKER_NAME          := arrow-lib-template-rust
          - PACKAGE_NAME         := lib-template-rust
          + DOCKER_NAME := arrow-lib-template-rust
            
          - PUBLISH_PACKAGE_NAME := lib-template-rust
          + help: .help-base .help-cspell .help-markdown .help-editorconfig
            
          - help: .help-base .help-rust .help-python .help-cspell .help-markdown .help-editorconfig .help-commitlint .help-toml
          - build: rust-build
          - 
          - export
          - 
          - clean: rust-clean
          - release: rust-release
          - publish: rust-publish
          - test: rust-test-all cspell-test toml-test python-test md-test-links editorconfig-test
          - tidy: rust-tidy toml-tidy python-tidy editorconfig-tidy
          - all: clean test build release publish
          - 
            include .make/base.mk
            include .make/cspell.mk
            include .make/markdown.mk
            include .make/editorconfig.mk
          - include .make/commitlint.mk
          - include .make/toml.mk
          - include .make/rust.mk
          - include .make/python.mk
          + 
          + test: cspell-test md-test-links editorconfig-test
        EOT
        id                  = "lib-template-rust/Makefile"
        # (7 unchanged attributes hidden)
    }

  # module.repository_rust_lib["router"].github_repository_file.files[".env.base.tftpl"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = "chore(ci): .env.base.tftpl - provisioned by terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-lib/.env.base.tftpl
            
            DOCKER_NAME          := arrow-lib-router
            PACKAGE_NAME         := lib-router
            PUBLISH_PACKAGE_NAME := lib-router
            
        EOT
      + file                = ".env.base.tftpl"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-router"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["router"].github_repository_file.files[".make/docker.mk"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/docker.mk
            
            DOCKER_BUILD_PATH ?= .
            
            .help-docker:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Docker targets$(SGR0)"
            	@echo "  $(BOLD)docker-build$(SGR0)   -- Run docker build to create new image"
            	@echo "  $(BOLD)docker-run$(SGR0)     -- Run docker container as a daemon, binding port $(HOST_PORT):$(DOCKER_PORT)"
            	@echo "  $(BOLD)docker-stop$(SGR0)    -- Run 'docker kill $${DOCKER_NAME}-run' to stop our docker after running"
            
            docker-build:
            	@DOCKER_BUILDKIT=1 docker build --build-arg PACKAGE_NAME=$(PACKAGE_NAME) --tag $(PACKAGE_NAME):latest $(DOCKER_BUILD_PATH)
            
            docker-run: docker-stop
            	# Run docker container as a daemon and map a port
          - 	@docker run --rm -d -p $(HOST_PORT_GRPC):$(DOCKER_PORT_GRPC) -p $(HOST_PORT_REST):$(DOCKER_PORT_REST) --name=$(DOCKER_NAME)-run $(PACKAGE_NAME):latest
          + 	@docker run --rm -d --env-file .env -p $(HOST_PORT_GRPC):$(DOCKER_PORT_GRPC) -p $(HOST_PORT_REST):$(DOCKER_PORT_REST) --name=$(DOCKER_NAME)-run $(PACKAGE_NAME):latest
            	@echo "$(YELLOW)Docker running and listening to http://localhost:$(HOST_PORT_GRPC) and http://localhost:$(HOST_PORT_REST) $(SGR0)"
            
            docker-stop:
            	@docker kill ${DOCKER_NAME}-run || true
        EOT
        id                  = "lib-router/.make/docker.mk"
        # (7 unchanged attributes hidden)
    }

  # module.repository_rust_lib["router"].github_repository_file.files[".make/env.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = "chore(ci): .make/env.mk - provisioned by terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/env.mk
            
            ENV_FILE := $(wildcard .env .env.base)
            # If .env is missing, install .env.base+.env.repo as .env and load that.
            ifeq ($(ENV_FILE),.env.base)
            $(warning Settings file '.env' missing: '$(ENV_FILE)' => installing .env as merge of .env.base + .env.repo!)
            $(shell cat .env.base .env.repo > .env 2>/dev/null)
            endif
            
            # Sanity check, make sure keys from base and repo are present.
            # Strip empty lines and comments, get sorted keys (e.g. DOCKER_NAME)
            ENV_KEYS=$(shell grep -Ehv '^\s*(#.*)?\s*$$' .env.base .env.repo 2>/dev/null | cut -f1 -d= | sort)
            # Check if key exists in .env, if not grep it from the .env.base/repo into your .env
            $(foreach k, $(ENV_KEYS), $(eval $(shell sh -c "grep -q '^$(k)=' .env 2>/dev/null || (echo '*** NOTE: Adding missing .env key [$(k)] to your .env file!' 1>&2 ; grep -h '^$(k)=' .env.base .env.repo 2>/dev/null >> .env ; grep '^$(k)=' .env 1>&2)")))
            
            -include $(ENV_FILE)
            
        EOT
      + file                = ".make/env.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-router"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["router"].github_repository_file.files["Makefile"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
          - # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/Makefile.tftpl
          + # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/Makefile
            
          - DOCKER_NAME          := arrow-lib-router
          - PACKAGE_NAME         := lib-router
          + DOCKER_NAME := arrow-lib-router
            
          - PUBLISH_PACKAGE_NAME := lib-router
          + help: .help-base .help-cspell .help-markdown .help-editorconfig
            
          - help: .help-base .help-rust .help-python .help-cspell .help-markdown .help-editorconfig .help-commitlint .help-toml
          - build: rust-build
          - 
          - export
          - 
          - clean: rust-clean
          - release: rust-release
          - publish: rust-publish
          - test: rust-test-all cspell-test toml-test python-test md-test-links editorconfig-test
          - tidy: rust-tidy toml-tidy python-tidy editorconfig-tidy
          - all: clean test build release publish
          - 
            include .make/base.mk
            include .make/cspell.mk
            include .make/markdown.mk
            include .make/editorconfig.mk
          - include .make/commitlint.mk
          - include .make/toml.mk
          - include .make/rust.mk
          - include .make/python.mk
          + 
          + test: cspell-test md-test-links editorconfig-test
        EOT
        id                  = "lib-router/Makefile"
        # (7 unchanged attributes hidden)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".env.base.tftpl"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = "chore(ci): .env.base.tftpl - provisioned by terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-svc/.env.base.tftpl
            
            DOCKER_NAME          := arrow-svc-cargo
            PACKAGE_NAME         := svc-cargo
            PUBLISH_PACKAGE_NAME := svc-cargo-client-grpc
            DOCKER_PORT_REST     := 8000
            DOCKER_PORT_GRPC     := 50051
            HOST_PORT_REST       := 8000
            HOST_PORT_GRPC       := 50000
            
        EOT
      + file                = ".env.base.tftpl"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".make/docker.mk"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/docker.mk
            
            DOCKER_BUILD_PATH ?= .
            
            .help-docker:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Docker targets$(SGR0)"
            	@echo "  $(BOLD)docker-build$(SGR0)   -- Run docker build to create new image"
            	@echo "  $(BOLD)docker-run$(SGR0)     -- Run docker container as a daemon, binding port $(HOST_PORT):$(DOCKER_PORT)"
            	@echo "  $(BOLD)docker-stop$(SGR0)    -- Run 'docker kill $${DOCKER_NAME}-run' to stop our docker after running"
            
            docker-build:
            	@DOCKER_BUILDKIT=1 docker build --build-arg PACKAGE_NAME=$(PACKAGE_NAME) --tag $(PACKAGE_NAME):latest $(DOCKER_BUILD_PATH)
            
            docker-run: docker-stop
            	# Run docker container as a daemon and map a port
          - 	@docker run --rm -d -p $(HOST_PORT_GRPC):$(DOCKER_PORT_GRPC) -p $(HOST_PORT_REST):$(DOCKER_PORT_REST) --name=$(DOCKER_NAME)-run $(PACKAGE_NAME):latest
          + 	@docker run --rm -d --env-file .env -p $(HOST_PORT_GRPC):$(DOCKER_PORT_GRPC) -p $(HOST_PORT_REST):$(DOCKER_PORT_REST) --name=$(DOCKER_NAME)-run $(PACKAGE_NAME):latest
            	@echo "$(YELLOW)Docker running and listening to http://localhost:$(HOST_PORT_GRPC) and http://localhost:$(HOST_PORT_REST) $(SGR0)"
            
            docker-stop:
            	@docker kill ${DOCKER_NAME}-run || true
        EOT
        id                  = "svc-cargo/.make/docker.mk"
        # (7 unchanged attributes hidden)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".make/env.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = "chore(ci): .make/env.mk - provisioned by terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/env.mk
            
            ENV_FILE := $(wildcard .env .env.base)
            # If .env is missing, install .env.base+.env.repo as .env and load that.
            ifeq ($(ENV_FILE),.env.base)
            $(warning Settings file '.env' missing: '$(ENV_FILE)' => installing .env as merge of .env.base + .env.repo!)
            $(shell cat .env.base .env.repo > .env 2>/dev/null)
            endif
            
            # Sanity check, make sure keys from base and repo are present.
            # Strip empty lines and comments, get sorted keys (e.g. DOCKER_NAME)
            ENV_KEYS=$(shell grep -Ehv '^\s*(#.*)?\s*$$' .env.base .env.repo 2>/dev/null | cut -f1 -d= | sort)
            # Check if key exists in .env, if not grep it from the .env.base/repo into your .env
            $(foreach k, $(ENV_KEYS), $(eval $(shell sh -c "grep -q '^$(k)=' .env 2>/dev/null || (echo '*** NOTE: Adding missing .env key [$(k)] to your .env file!' 1>&2 ; grep -h '^$(k)=' .env.base .env.repo 2>/dev/null >> .env ; grep '^$(k)=' .env 1>&2)")))
            
            -include $(ENV_FILE)
            
        EOT
      + file                = ".make/env.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files["Makefile"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
          - # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/Makefile.tftpl
          + # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/Makefile
            
          - DOCKER_NAME          := arrow-svc-cargo
          - PACKAGE_NAME         := svc-cargo
          + DOCKER_NAME := arrow-svc-cargo
            
          - PUBLISH_PACKAGE_NAME := svc-cargo-client-grpc
          - DOCKER_PORT_REST     := 8000
          - DOCKER_PORT_GRPC     := 50051
          - HOST_PORT_REST       := 8000
          - HOST_PORT_GRPC       := 50000
          + help: .help-base .help-cspell .help-markdown .help-editorconfig
            
          - help: .help-base .help-rust .help-python .help-cspell .help-markdown .help-editorconfig .help-commitlint .help-toml .help-docker
          - build: rust-build docker-build
          - 
          - include .make/docker.mk
          - 
          - export
          - 
          - clean: rust-clean
          - release: rust-release
          - publish: rust-publish
          - test: rust-test-all cspell-test toml-test python-test md-test-links editorconfig-test
          - tidy: rust-tidy toml-tidy python-tidy editorconfig-tidy
          - all: clean test build release publish
          - 
            include .make/base.mk
            include .make/cspell.mk
            include .make/markdown.mk
            include .make/editorconfig.mk
          - include .make/commitlint.mk
          - include .make/toml.mk
          - include .make/rust.mk
          - include .make/python.mk
          + 
          + test: cspell-test md-test-links editorconfig-test
        EOT
        id                  = "svc-cargo/Makefile"
        # (7 unchanged attributes hidden)
    }

  # module.repository_rust_svc["pricing"].github_repository_file.files[".env.base.tftpl"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = "chore(ci): .env.base.tftpl - provisioned by terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-svc/.env.base.tftpl
            
            DOCKER_NAME          := arrow-svc-pricing
            PACKAGE_NAME         := svc-pricing
            PUBLISH_PACKAGE_NAME := svc-pricing-client-grpc
            DOCKER_PORT_REST     := 8000
            DOCKER_PORT_GRPC     := 50051
            HOST_PORT_REST       := 8001
            HOST_PORT_GRPC       := 50001
            
        EOT
      + file                = ".env.base.tftpl"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-pricing"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["pricing"].github_repository_file.files[".make/docker.mk"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/docker.mk
            
            DOCKER_BUILD_PATH ?= .
            
            .help-docker:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Docker targets$(SGR0)"
            	@echo "  $(BOLD)docker-build$(SGR0)   -- Run docker build to create new image"
            	@echo "  $(BOLD)docker-run$(SGR0)     -- Run docker container as a daemon, binding port $(HOST_PORT):$(DOCKER_PORT)"
            	@echo "  $(BOLD)docker-stop$(SGR0)    -- Run 'docker kill $${DOCKER_NAME}-run' to stop our docker after running"
            
            docker-build:
            	@DOCKER_BUILDKIT=1 docker build --build-arg PACKAGE_NAME=$(PACKAGE_NAME) --tag $(PACKAGE_NAME):latest $(DOCKER_BUILD_PATH)
            
            docker-run: docker-stop
            	# Run docker container as a daemon and map a port
          - 	@docker run --rm -d -p $(HOST_PORT_GRPC):$(DOCKER_PORT_GRPC) -p $(HOST_PORT_REST):$(DOCKER_PORT_REST) --name=$(DOCKER_NAME)-run $(PACKAGE_NAME):latest
          + 	@docker run --rm -d --env-file .env -p $(HOST_PORT_GRPC):$(DOCKER_PORT_GRPC) -p $(HOST_PORT_REST):$(DOCKER_PORT_REST) --name=$(DOCKER_NAME)-run $(PACKAGE_NAME):latest
            	@echo "$(YELLOW)Docker running and listening to http://localhost:$(HOST_PORT_GRPC) and http://localhost:$(HOST_PORT_REST) $(SGR0)"
            
            docker-stop:
            	@docker kill ${DOCKER_NAME}-run || true
        EOT
        id                  = "svc-pricing/.make/docker.mk"
        # (7 unchanged attributes hidden)
    }

  # module.repository_rust_svc["pricing"].github_repository_file.files[".make/env.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = "chore(ci): .make/env.mk - provisioned by terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/env.mk
            
            ENV_FILE := $(wildcard .env .env.base)
            # If .env is missing, install .env.base+.env.repo as .env and load that.
            ifeq ($(ENV_FILE),.env.base)
            $(warning Settings file '.env' missing: '$(ENV_FILE)' => installing .env as merge of .env.base + .env.repo!)
            $(shell cat .env.base .env.repo > .env 2>/dev/null)
            endif
            
            # Sanity check, make sure keys from base and repo are present.
            # Strip empty lines and comments, get sorted keys (e.g. DOCKER_NAME)
            ENV_KEYS=$(shell grep -Ehv '^\s*(#.*)?\s*$$' .env.base .env.repo 2>/dev/null | cut -f1 -d= | sort)
            # Check if key exists in .env, if not grep it from the .env.base/repo into your .env
            $(foreach k, $(ENV_KEYS), $(eval $(shell sh -c "grep -q '^$(k)=' .env 2>/dev/null || (echo '*** NOTE: Adding missing .env key [$(k)] to your .env file!' 1>&2 ; grep -h '^$(k)=' .env.base .env.repo 2>/dev/null >> .env ; grep '^$(k)=' .env 1>&2)")))
            
            -include $(ENV_FILE)
            
        EOT
      + file                = ".make/env.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-pricing"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["pricing"].github_repository_file.files["Makefile"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
          - # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/Makefile.tftpl
          + # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/Makefile
            
          - DOCKER_NAME          := arrow-svc-pricing
          - PACKAGE_NAME         := svc-pricing
          + DOCKER_NAME := arrow-svc-pricing
            
          - PUBLISH_PACKAGE_NAME := svc-pricing-client-grpc
          - DOCKER_PORT_REST     := 8000
          - DOCKER_PORT_GRPC     := 50051
          - HOST_PORT_REST       := 8001
          - HOST_PORT_GRPC       := 50001
          + help: .help-base .help-cspell .help-markdown .help-editorconfig
            
          - help: .help-base .help-rust .help-python .help-cspell .help-markdown .help-editorconfig .help-commitlint .help-toml .help-docker
          - build: rust-build docker-build
          - 
          - include .make/docker.mk
          - 
          - export
          - 
          - clean: rust-clean
          - release: rust-release
          - publish: rust-publish
          - test: rust-test-all cspell-test toml-test python-test md-test-links editorconfig-test
          - tidy: rust-tidy toml-tidy python-tidy editorconfig-tidy
          - all: clean test build release publish
          - 
            include .make/base.mk
            include .make/cspell.mk
            include .make/markdown.mk
            include .make/editorconfig.mk
          - include .make/commitlint.mk
          - include .make/toml.mk
          - include .make/rust.mk
          - include .make/python.mk
          + 
          + test: cspell-test md-test-links editorconfig-test
        EOT
        id                  = "svc-pricing/Makefile"
        # (7 unchanged attributes hidden)
    }

  # module.repository_rust_svc["scheduler"].github_repository_file.files[".env.base.tftpl"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = "chore(ci): .env.base.tftpl - provisioned by terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-svc/.env.base.tftpl
            
            DOCKER_NAME          := arrow-svc-scheduler
            PACKAGE_NAME         := svc-scheduler
            PUBLISH_PACKAGE_NAME := svc-scheduler-client-grpc
            DOCKER_PORT_REST     := 8000
            DOCKER_PORT_GRPC     := 50051
            HOST_PORT_REST       := 8002
            HOST_PORT_GRPC       := 50002
            
        EOT
      + file                = ".env.base.tftpl"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-scheduler"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["scheduler"].github_repository_file.files[".make/docker.mk"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/docker.mk
            
            DOCKER_BUILD_PATH ?= .
            
            .help-docker:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Docker targets$(SGR0)"
            	@echo "  $(BOLD)docker-build$(SGR0)   -- Run docker build to create new image"
            	@echo "  $(BOLD)docker-run$(SGR0)     -- Run docker container as a daemon, binding port $(HOST_PORT):$(DOCKER_PORT)"
            	@echo "  $(BOLD)docker-stop$(SGR0)    -- Run 'docker kill $${DOCKER_NAME}-run' to stop our docker after running"
            
            docker-build:
            	@DOCKER_BUILDKIT=1 docker build --build-arg PACKAGE_NAME=$(PACKAGE_NAME) --tag $(PACKAGE_NAME):latest $(DOCKER_BUILD_PATH)
            
            docker-run: docker-stop
            	# Run docker container as a daemon and map a port
          - 	@docker run --rm -d -p $(HOST_PORT_GRPC):$(DOCKER_PORT_GRPC) -p $(HOST_PORT_REST):$(DOCKER_PORT_REST) --name=$(DOCKER_NAME)-run $(PACKAGE_NAME):latest
          + 	@docker run --rm -d --env-file .env -p $(HOST_PORT_GRPC):$(DOCKER_PORT_GRPC) -p $(HOST_PORT_REST):$(DOCKER_PORT_REST) --name=$(DOCKER_NAME)-run $(PACKAGE_NAME):latest
            	@echo "$(YELLOW)Docker running and listening to http://localhost:$(HOST_PORT_GRPC) and http://localhost:$(HOST_PORT_REST) $(SGR0)"
            
            docker-stop:
            	@docker kill ${DOCKER_NAME}-run || true
        EOT
        id                  = "svc-scheduler/.make/docker.mk"
        # (7 unchanged attributes hidden)
    }

  # module.repository_rust_svc["scheduler"].github_repository_file.files[".make/env.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = "chore(ci): .make/env.mk - provisioned by terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/env.mk
            
            ENV_FILE := $(wildcard .env .env.base)
            # If .env is missing, install .env.base+.env.repo as .env and load that.
            ifeq ($(ENV_FILE),.env.base)
            $(warning Settings file '.env' missing: '$(ENV_FILE)' => installing .env as merge of .env.base + .env.repo!)
            $(shell cat .env.base .env.repo > .env 2>/dev/null)
            endif
            
            # Sanity check, make sure keys from base and repo are present.
            # Strip empty lines and comments, get sorted keys (e.g. DOCKER_NAME)
            ENV_KEYS=$(shell grep -Ehv '^\s*(#.*)?\s*$$' .env.base .env.repo 2>/dev/null | cut -f1 -d= | sort)
            # Check if key exists in .env, if not grep it from the .env.base/repo into your .env
            $(foreach k, $(ENV_KEYS), $(eval $(shell sh -c "grep -q '^$(k)=' .env 2>/dev/null || (echo '*** NOTE: Adding missing .env key [$(k)] to your .env file!' 1>&2 ; grep -h '^$(k)=' .env.base .env.repo 2>/dev/null >> .env ; grep '^$(k)=' .env 1>&2)")))
            
            -include $(ENV_FILE)
            
        EOT
      + file                = ".make/env.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-scheduler"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["scheduler"].github_repository_file.files["Makefile"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
          - # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/Makefile.tftpl
          + # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/Makefile
            
          - DOCKER_NAME          := arrow-svc-scheduler
          - PACKAGE_NAME         := svc-scheduler
          + DOCKER_NAME := arrow-svc-scheduler
            
          - PUBLISH_PACKAGE_NAME := svc-scheduler-client-grpc
          - DOCKER_PORT_REST     := 8000
          - DOCKER_PORT_GRPC     := 50051
          - HOST_PORT_REST       := 8002
          - HOST_PORT_GRPC       := 50002
          + help: .help-base .help-cspell .help-markdown .help-editorconfig
            
          - help: .help-base .help-rust .help-python .help-cspell .help-markdown .help-editorconfig .help-commitlint .help-toml .help-docker
          - build: rust-build docker-build
          - 
          - include .make/docker.mk
          - 
          - export
          - 
          - clean: rust-clean
          - release: rust-release
          - publish: rust-publish
          - test: rust-test-all cspell-test toml-test python-test md-test-links editorconfig-test
          - tidy: rust-tidy toml-tidy python-tidy editorconfig-tidy
          - all: clean test build release publish
          - 
            include .make/base.mk
            include .make/cspell.mk
            include .make/markdown.mk
            include .make/editorconfig.mk
          - include .make/commitlint.mk
          - include .make/toml.mk
          - include .make/rust.mk
          - include .make/python.mk
          + 
          + test: cspell-test md-test-links editorconfig-test
        EOT
        id                  = "svc-scheduler/Makefile"
        # (7 unchanged attributes hidden)
    }

  # module.repository_rust_svc["storage"].github_repository_file.files[".env.base.tftpl"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = "chore(ci): .env.base.tftpl - provisioned by terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-svc/.env.base.tftpl
            
            DOCKER_NAME          := arrow-svc-storage
            PACKAGE_NAME         := svc-storage
            PUBLISH_PACKAGE_NAME := svc-storage-client-grpc
            DOCKER_PORT_REST     := 8000
            DOCKER_PORT_GRPC     := 50051
            HOST_PORT_REST       := 8003
            HOST_PORT_GRPC       := 50003
            
        EOT
      + file                = ".env.base.tftpl"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-storage"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["storage"].github_repository_file.files[".make/docker.mk"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/docker.mk
            
            DOCKER_BUILD_PATH ?= .
            
            .help-docker:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Docker targets$(SGR0)"
            	@echo "  $(BOLD)docker-build$(SGR0)   -- Run docker build to create new image"
            	@echo "  $(BOLD)docker-run$(SGR0)     -- Run docker container as a daemon, binding port $(HOST_PORT):$(DOCKER_PORT)"
            	@echo "  $(BOLD)docker-stop$(SGR0)    -- Run 'docker kill $${DOCKER_NAME}-run' to stop our docker after running"
            
            docker-build:
            	@DOCKER_BUILDKIT=1 docker build --build-arg PACKAGE_NAME=$(PACKAGE_NAME) --tag $(PACKAGE_NAME):latest $(DOCKER_BUILD_PATH)
            
            docker-run: docker-stop
            	# Run docker container as a daemon and map a port
          - 	@docker run --rm -d -p $(HOST_PORT_GRPC):$(DOCKER_PORT_GRPC) -p $(HOST_PORT_REST):$(DOCKER_PORT_REST) --name=$(DOCKER_NAME)-run $(PACKAGE_NAME):latest
          + 	@docker run --rm -d --env-file .env -p $(HOST_PORT_GRPC):$(DOCKER_PORT_GRPC) -p $(HOST_PORT_REST):$(DOCKER_PORT_REST) --name=$(DOCKER_NAME)-run $(PACKAGE_NAME):latest
            	@echo "$(YELLOW)Docker running and listening to http://localhost:$(HOST_PORT_GRPC) and http://localhost:$(HOST_PORT_REST) $(SGR0)"
            
            docker-stop:
            	@docker kill ${DOCKER_NAME}-run || true
        EOT
        id                  = "svc-storage/.make/docker.mk"
        # (7 unchanged attributes hidden)
    }

  # module.repository_rust_svc["storage"].github_repository_file.files[".make/env.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = "chore(ci): .make/env.mk - provisioned by terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/env.mk
            
            ENV_FILE := $(wildcard .env .env.base)
            # If .env is missing, install .env.base+.env.repo as .env and load that.
            ifeq ($(ENV_FILE),.env.base)
            $(warning Settings file '.env' missing: '$(ENV_FILE)' => installing .env as merge of .env.base + .env.repo!)
            $(shell cat .env.base .env.repo > .env 2>/dev/null)
            endif
            
            # Sanity check, make sure keys from base and repo are present.
            # Strip empty lines and comments, get sorted keys (e.g. DOCKER_NAME)
            ENV_KEYS=$(shell grep -Ehv '^\s*(#.*)?\s*$$' .env.base .env.repo 2>/dev/null | cut -f1 -d= | sort)
            # Check if key exists in .env, if not grep it from the .env.base/repo into your .env
            $(foreach k, $(ENV_KEYS), $(eval $(shell sh -c "grep -q '^$(k)=' .env 2>/dev/null || (echo '*** NOTE: Adding missing .env key [$(k)] to your .env file!' 1>&2 ; grep -h '^$(k)=' .env.base .env.repo 2>/dev/null >> .env ; grep '^$(k)=' .env 1>&2)")))
            
            -include $(ENV_FILE)
            
        EOT
      + file                = ".make/env.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-storage"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["storage"].github_repository_file.files["Makefile"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
          - # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/Makefile.tftpl
          + # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/Makefile
            
          - DOCKER_NAME          := arrow-svc-storage
          - PACKAGE_NAME         := svc-storage
          + DOCKER_NAME := arrow-svc-storage
            
          - PUBLISH_PACKAGE_NAME := svc-storage-client-grpc
          - DOCKER_PORT_REST     := 8000
          - DOCKER_PORT_GRPC     := 50051
          - HOST_PORT_REST       := 8003
          - HOST_PORT_GRPC       := 50003
          + help: .help-base .help-cspell .help-markdown .help-editorconfig
            
          - help: .help-base .help-rust .help-python .help-cspell .help-markdown .help-editorconfig .help-commitlint .help-toml .help-docker
          - build: rust-build docker-build
          - 
          - include .make/docker.mk
          - 
          - export
          - 
          - clean: rust-clean
          - release: rust-release
          - publish: rust-publish
          - test: rust-test-all cspell-test toml-test python-test md-test-links editorconfig-test
          - tidy: rust-tidy toml-tidy python-tidy editorconfig-tidy
          - all: clean test build release publish
          - 
            include .make/base.mk
            include .make/cspell.mk
            include .make/markdown.mk
            include .make/editorconfig.mk
          - include .make/commitlint.mk
          - include .make/toml.mk
          - include .make/rust.mk
          - include .make/python.mk
          + 
          + test: cspell-test md-test-links editorconfig-test
        EOT
        id                  = "svc-storage/Makefile"
        # (7 unchanged attributes hidden)
    }

  # module.repository_svc_template["rust"].github_repository_file.files[".env.base.tftpl"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = "chore(ci): .env.base.tftpl - provisioned by terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-svc/.env.base.tftpl
            
            DOCKER_NAME          := arrow-svc-template-rust
            PACKAGE_NAME         := svc-template-rust
            PUBLISH_PACKAGE_NAME := svc-template-rust-client-grpc
            DOCKER_PORT_REST     := 8000
            DOCKER_PORT_GRPC     := 50051
            HOST_PORT_REST       := 8080
            HOST_PORT_GRPC       := 50051
            
        EOT
      + file                = ".env.base.tftpl"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-template-rust"
      + sha                 = (known after apply)
    }

  # module.repository_svc_template["rust"].github_repository_file.files[".make/docker.mk"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/docker.mk
            
            DOCKER_BUILD_PATH ?= .
            
            .help-docker:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Docker targets$(SGR0)"
            	@echo "  $(BOLD)docker-build$(SGR0)   -- Run docker build to create new image"
            	@echo "  $(BOLD)docker-run$(SGR0)     -- Run docker container as a daemon, binding port $(HOST_PORT):$(DOCKER_PORT)"
            	@echo "  $(BOLD)docker-stop$(SGR0)    -- Run 'docker kill $${DOCKER_NAME}-run' to stop our docker after running"
            
            docker-build:
            	@DOCKER_BUILDKIT=1 docker build --build-arg PACKAGE_NAME=$(PACKAGE_NAME) --tag $(PACKAGE_NAME):latest $(DOCKER_BUILD_PATH)
            
            docker-run: docker-stop
            	# Run docker container as a daemon and map a port
          - 	@docker run --rm -d -p $(HOST_PORT_GRPC):$(DOCKER_PORT_GRPC) -p $(HOST_PORT_REST):$(DOCKER_PORT_REST) --name=$(DOCKER_NAME)-run $(PACKAGE_NAME):latest
          + 	@docker run --rm -d --env-file .env -p $(HOST_PORT_GRPC):$(DOCKER_PORT_GRPC) -p $(HOST_PORT_REST):$(DOCKER_PORT_REST) --name=$(DOCKER_NAME)-run $(PACKAGE_NAME):latest
            	@echo "$(YELLOW)Docker running and listening to http://localhost:$(HOST_PORT_GRPC) and http://localhost:$(HOST_PORT_REST) $(SGR0)"
            
            docker-stop:
            	@docker kill ${DOCKER_NAME}-run || true
        EOT
        id                  = "svc-template-rust/.make/docker.mk"
        # (7 unchanged attributes hidden)
    }

  # module.repository_svc_template["rust"].github_repository_file.files[".make/env.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = "chore(ci): .make/env.mk - provisioned by terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/env.mk
            
            ENV_FILE := $(wildcard .env .env.base)
            # If .env is missing, install .env.base+.env.repo as .env and load that.
            ifeq ($(ENV_FILE),.env.base)
            $(warning Settings file '.env' missing: '$(ENV_FILE)' => installing .env as merge of .env.base + .env.repo!)
            $(shell cat .env.base .env.repo > .env 2>/dev/null)
            endif
            
            # Sanity check, make sure keys from base and repo are present.
            # Strip empty lines and comments, get sorted keys (e.g. DOCKER_NAME)
            ENV_KEYS=$(shell grep -Ehv '^\s*(#.*)?\s*$$' .env.base .env.repo 2>/dev/null | cut -f1 -d= | sort)
            # Check if key exists in .env, if not grep it from the .env.base/repo into your .env
            $(foreach k, $(ENV_KEYS), $(eval $(shell sh -c "grep -q '^$(k)=' .env 2>/dev/null || (echo '*** NOTE: Adding missing .env key [$(k)] to your .env file!' 1>&2 ; grep -h '^$(k)=' .env.base .env.repo 2>/dev/null >> .env ; grep '^$(k)=' .env 1>&2)")))
            
            -include $(ENV_FILE)
            
        EOT
      + file                = ".make/env.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-template-rust"
      + sha                 = (known after apply)
    }

  # module.repository_svc_template["rust"].github_repository_file.files["Makefile"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
          - # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/Makefile.tftpl
          + # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/Makefile
            
          - DOCKER_NAME          := arrow-svc-template-rust
          - PACKAGE_NAME         := svc-template-rust
          + DOCKER_NAME := arrow-svc-template-rust
            
          - PUBLISH_PACKAGE_NAME := svc-template-rust-client-grpc
          - DOCKER_PORT_REST     := 8000
          - DOCKER_PORT_GRPC     := 50051
          - HOST_PORT_REST       := 8080
          - HOST_PORT_GRPC       := 50051
          + help: .help-base .help-cspell .help-markdown .help-editorconfig
            
          - help: .help-base .help-rust .help-python .help-cspell .help-markdown .help-editorconfig .help-commitlint .help-toml .help-docker
          - build: rust-build docker-build
          - 
          - include .make/docker.mk
          - 
          - export
          - 
          - clean: rust-clean
          - release: rust-release
          - publish: rust-publish
          - test: rust-test-all cspell-test toml-test python-test md-test-links editorconfig-test
          - tidy: rust-tidy toml-tidy python-tidy editorconfig-tidy
          - all: clean test build release publish
          - 
            include .make/base.mk
            include .make/cspell.mk
            include .make/markdown.mk
            include .make/editorconfig.mk
          - include .make/commitlint.mk
          - include .make/toml.mk
          - include .make/rust.mk
          - include .make/python.mk
          + 
          + test: cspell-test md-test-links editorconfig-test
        EOT
        id                  = "svc-template-rust/Makefile"
        # (7 unchanged attributes hidden)
    }

Plan: 17 to add, 18 to change, 0 to destroy.

```

</details>

*Pusher: @benv666, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*